In [2]:
import pandas as pd

# Read All Tables

In [3]:
df=pd.read_csv('seperate_datasets/main_dataset.csv')
income_df=pd.read_csv('seperate_datasets/income.csv')
lac_ranks=pd.read_csv('seperate_datasets/lac_ranking.csv')
univ_ranks=pd.read_csv('seperate_datasets/univ_rankings.csv')
ncaa=pd.read_csv('seperate_datasets/ncaa.csv')

/Users/mayamadhavan/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2785: DtypeWarning: Columns (7,10,563,564,565,566,567,580,642,643,644,645,650,651) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
df=df.drop('Unnamed: 0', 1)
df.head()

,id,ope8_id,ope6_id,name,city,state,zip,accreditor,school_url,price_calculator_url,...,retention_rate_suppressed.four_year.full_time_pooled,retention_rate_suppressed.lt_four_year.full_time_pooled,retention_rate_suppressed.four_year.part_time_pooled,retention_rate_suppressed.lt_four_year.part_time_pooled,transfer_rate.4yr.full_time_pooled,transfer_rate.less_than_4yr.full_time_pooled,transfer_rate.cohort_4yr.full_time_pooled,transfer_rate.cohort_less_than_4yr.full_time_pooled,transfer_rate_suppressed.4yr.full_time_pooled,transfer_rate_suppressed.less_than_4yr.full_time_pooled
0,100654,100200,1002,Alabama A & M University,Normal,AL,35762,Southern Association of Colleges and Schools C...,www.aamu.edu/,www2.aamu.edu/scripts/netpricecalc/npcalc.htm,...,0.61638362831858,NaN,0.41664791666666,NaN,0.200384,NaN,2086.0,NaN,0.20038350910834,NaN
1,100663,105200,1052,University of Alabama at Birmingham,Birmingham,AL,35294-0110,Southern Association of Colleges and Schools C...,www.uab.edu,uab.studentaidcalculator.com/survey.aspx,...,0.80765744125326,NaN,0.58823529411764,NaN,0.241619,NaN,2740.0,NaN,0.24161927007299,NaN
2,100690,2503400,25034,Amridge University,Montgomery,AL,36117-3553,Southern Association of Colleges and Schools C...,www.amridgeuniversity.edu,www2.amridgeuniversity.edu:9091/,...,PrivacySuppressed,NaN,PrivacySuppressed,NaN,0.111111,NaN,18.0,NaN,PrivacySuppressed,NaN
3,100706,105500,1055,University of Alabama in Huntsville,Huntsville,AL,35899,Southern Association of Colleges and Schools C...,www.uah.edu,finaid.uah.edu/,...,0.78698579881656,NaN,0.50876842105263,NaN,0.332677,NaN,1539.0,NaN,0.33267738791423,NaN
4,100724,100500,1005,Alabama State University,Montgomery,AL,36104-0271,Southern Association of Colleges and Schools C...,www.alasu.edu,www.alasu.edu/cost-aid/forms/calculator/index....,...,0.58470804331013,NaN,0.43181818181818,NaN,0.000000,NaN,2539.0,NaN,0,NaN

In [5]:
income_df=income_df.drop('Unnamed: 0', 1)
income_df.head()

,school_info,Degree Type,sector,early_pay,Mid-Career Pay,high_meaning,percent_stem,name
0,"Engineering, Liberal Arts School, Private School",NaN,Private not-for-profit,81000,155800,85,85,Harvey Mudd College
1,"Ivy League, Private School, Research Universit...",NaN,Private not-for-profit,69800,147800,47,47,Princeton University
2,"Engineering, Private School, Research University",NaN,Private not-for-profit,81500,147000,69,69,Massachusetts Institute of Technology
3,State School,NaN,Public,71600,145100,35,35,SUNY Maritime College
4,"Liberal Arts School, Sober School, For Sports ...",NaN,Public,75100,144300,43,43,United States Military Academy

In [6]:
lac_ranks=lac_ranks.drop('Unnamed: 0', 1)
lac_ranks=lac_ranks.drop('lac', 1)
lac_ranks.head()

,index,Enrollment,name,city,state,rank,base_fees,in-state,univ
0,0,2076.0,Williams College,Williamstown,MA,1,53550.0,NaN,lac
1,1,1849.0,Amherst College,Amherst,MA,2,54310.0,NaN,lac
2,2,1806.0,Bowdoin College,Brunswick,ME,3,51848.0,NaN,lac
3,3,1543.0,Swarthmore College,Swarthmore,PA,3,50822.0,NaN,lac
4,4,2347.0,Wellesley College,Wellesley,MA,3,51148.0,NaN,lac

In [7]:
univ_ranks=univ_ranks.drop('Unnamed: 0', 1)
univ_ranks.head()

,name,Location,Rank,Description,Tuition and fees,In-state,Undergrad Enrollment,univ
0,Princeton University,"Princeton, NJ",1,"Princeton, the fourth-oldest college in the Un...",45320,NaN,"5,402",univ
1,Harvard University,"Cambridge, MA",2,"Harvard is located in Cambridge, Massachusetts...",47074,NaN,"6,699",univ
2,University of Chicago,"Chicago, IL",3,"The University of Chicago, situated in Chicago...",52491,NaN,"5,844",univ
3,Yale University,"New Haven, CT",3,"Yale University, located in New Haven, Connect...",49480,NaN,"5,532",univ
4,Columbia University,"New York, NY",5,"Columbia University, located in Manhattan's Mo...",55056,NaN,"6,102",univ

In [8]:
ncaa=ncaa.drop('Unnamed: 0', 1)
ncaa.head()

,City,Conference,Nickname,name,State,division,ncaa_rated
0,San Francisco,Pacific West Conference,Urban Knights,Academy of Art University,California,D2,ncaa
1,Alamosa,Rocky Mountain Athletic Conference,Grizzlies,Adams State University,Colorado,D2,ncaa
2,Garden City,Northeast-10 Conference,Panthers,Adelphi University,New York,D2,ncaa
3,Huntsville,Gulf South Conference,Chargers,University of Alabama in Huntsville,Alabama,D2,ncaa
4,Fairbanks,Great Northwest Athletic Conference,Nanooks,University of Alaska Fairbanks,Alaska,D2,ncaa

# Cleaning

look at correlation
1. get rid of cc and open admission
2. how many are left
3. how many nulls do i have
4. if so can i still join, what is the overlap
5. if too few, think of how to impute values for most relevant columns (Think about what is important to seniors)

## Drop Non Regionally Accredited Schools

In [9]:
association=['North Central Association of Colleges and Schools The Higher Learning Commission',
'Southern Association of Colleges and Schools Commission on Colleges',
'Middle States Commission on Higher Education',
'New England Association of Schools and Colleges Commission on Institutions of Higher Education',
'Western Association of Schools and Colleges Senior Colleges and University Commission',
'Northwest Commission on Colleges and Universities']

In [22]:
main_df=df[df.accreditor.isin(association)]

## Dropping Associates Degrees and School with Open Admissions Policy
1. Community Colleges
2. Schools that offer Associates Degrees
3. Technical Schools

In [23]:
main_df=main_df[main_df['carnegie_basic']>=15]

In [24]:
main_df=main_df[main_df['carnegie_basic']<=23]

In [25]:
main_df=main_df[main_df['open_admissions_policy']!=1]

In [26]:
main_df=main_df[main_df['open_admissions_policy']!=3]

##  Clean Columns of Interest From Scorecard Data, pre-join
### Columns
+ ACT Scores
+ SAT Scores
+ HBCU
+ Diversity
+ Net Price
+ Gender Ratio
+ Location
+ Locale
+ Name
+ Acceptance Rate

## Drop Columns not in Final Columns From Scorecard

Getting Column Names into List

In [27]:
count=0
names=[]
for column in list(main_df.columns):
    if 'net_price' in column or 'act_scores.midpoint' in column or 'sat_scores.midpoint' in column or 'program_precentage' in column  or 'name' in column  or 'minority_serving.historically_black' in column or 'location' in column or 'demographics' in column:
        names.append(column)
        count+=1

In [28]:
names.remove('avg_net_price.public')
names.remove('avg_net_price.private')
names.remove('demographics.age_entry')
names.remove('demographics.female_share')
names.remove('demographics.married')
names.remove('demographics.dependent')
names.remove('demographics.veteran')
names.remove('demographics.first_generation')
names.remove('demographics.avg_family_income')
names.remove('demographics.median_family_income')
names.remove('demographics.avg_family_income_independents')
names.remove('demographics.race_ethnicity.hispanic')
names.remove('demographics.race_ethnicity.asian')
names.remove('demographics.race_ethnicity.aian')
names.remove('demographics.race_ethnicity.nhpi')
names.remove('demographics.race_ethnicity.two_or_more')
names.remove('demographics.race_ethnicity.non_resident_alien')
names.remove('demographics.race_ethnicity.unknown')
names.remove('demographics.race_ethnicity.black')
names.remove('act_scores.midpoint.english')
names.remove('act_scores.midpoint.math')
names.remove('act_scores.midpoint.writing')
names.remove('demographics.men')
names.append('locale')
names.append('admission_rate.overall')

Dropping Other Columns

In [29]:
reduced_main_df=main_df[names]
len(reduced_main_df.columns)

28

In [34]:
len(reduced_main_df)

1432

Checking Remaining Null

In [30]:
reduced_main_df.isnull().sum()

name                                                0
location.lat                                        0
location.lon                                        0
minority_serving.historically_black                 0
sat_scores.midpoint.critical_reading              358
sat_scores.midpoint.math                          350
sat_scores.midpoint.writing                       782
act_scores.midpoint.cumulative                    335
demographics.race_ethnicity.white                  10
net_price.public.by_income_level.0-30000          912
net_price.public.by_income_level.30001-48000      913
net_price.public.by_income_level.48001-75000      913
net_price.public.by_income_level.75001-110000     917
net_price.public.by_income_level.110001-plus      930
net_price.private.by_income_level.0-30000         554
net_price.private.by_income_level.30001-48000     559
net_price.private.by_income_level.48001-75000     559
net_price.private.by_income_level.75001-110000    577
net_price.private.by_income_level.110001-plus     592
net_price.public.by_income_level.0-48000          912
net_price.private.by_income_level.0-48000         554
net_price.public.by_income_level.30001-75000      913
net_price.private.by_income_level.30001-75000     557
net_price.public.by_income_level.75000-plus       916
net_price.private.by_income_level.75000-plus      574
demographics.women                                 10
locale                                              0
admission_rate.overall                             33
dtype: int64

## Combining Prices to US Low Income, Middle Income, High Income Classifications

In [31]:
scors= ['sat_scores.midpoint.critical_reading', 'sat_scores.midpoint.math',
        'sat_scores.midpoint.writing', 'act_scores.midpoint.cumulative']

In [32]:
reduced_main_df[scors].head(10)

,sat_scores.midpoint.critical_reading,sat_scores.midpoint.math,sat_scores.midpoint.writing,act_scores.midpoint.cumulative
0,427.0,420.0,414.0,18.0
1,575.0,594.0,NaN,25.0
3,585.0,615.0,NaN,27.0
4,410.0,410.0,NaN,18.0
5,545.0,550.0,540.0,27.0
7,NaN,NaN,NaN,NaN
8,485.0,505.0,NaN,21.0
9,580.0,595.0,570.0,27.0
10,535.0,555.0,NaN,26.0
12,NaN,NaN,NaN,NaN

In [33]:
main_df[~main_df[scors].any(axis=1)][['carnegie_basic','name']]

      carnegie_basic                                               name
7               22.0                            Athens State University
12              22.0                          Concordia College Alabama
22              22.0                      Herzing University-Birmingham
60              18.0                     University of Alaska Anchorage
63              20.0                     University of Alaska Southeast
81              15.0                              University of Arizona
92              22.0      Embry-Riddle Aeronautical University-Prescott
95              18.0                            Grand Canyon University
138             18.0                           Arkansas Tech University
188             23.0                  University of Arkansas-Fort Smith
218             17.0           California Institute of Integral Studies
226             17.0         Alliant International University-San Diego
227             18.0            California State University-Bakersfield
228             18.0             California State University-Stanislaus
232             18.0        California State University-Dominguez Hills
235             18.0               California State University-East Bay
255             22.0       California State University Maritime Academy
279             16.0                      Claremont Graduate University
284             22.0                                   Cogswell College
316             17.0                       Fielding Graduate University
330             18.0               Golden Gate University-San Francisco
339             17.0                        Pacifica Graduate Institute
351             19.0                         John F. Kennedy University
352             21.0                         American Jewish University
402             18.0  Middlebury Institute of International Studies ...
440             21.0                                     Pitzer College
551             21.0                                   Colorado College
579             18.0                                  Naropa University
609             21.0                          Charter Oak State College
611             21.0                                Connecticut College
...              ...                                                ...
4178            18.0                     Antioch University-New England
4179            19.0                         Antioch University-Seattle
4180            19.0                         Antioch University-Midwest
4271            18.0                                Brandman University
4297            22.0                 University of Advancing Technology
4325            17.0  Mayo Clinic Graduate School of Biomedical Scie...
4376            20.0                                  Hodges University
4574            21.0                                     Beacon College
4584            22.0                              Everglades University
4586            23.0                     Herzing University-Winter Park
4717            20.0           California State University-Monterey Bay
4761            23.0             Johnson & Wales University-North Miami
4764            22.0  Trine University-Regional/Non-Traditional Camp...
5022            19.0                       University of Phoenix-Oregon
5041            23.0                          Herzing University-Kenner
5155            23.0                  Johnson & Wales University-Denver
5156            20.0                         University of Phoenix-Ohio
5209            22.0   Marlboro College Graduate & Professional Studies
5279            22.0                               Nevada State College
5282            20.0        California State University-Channel Islands
5381            23.0             National University College-Rio Grande
5385            17.0                            Northcentral University
5442            22.0                        Flagler College-Tallahassee
5456            22.0  Central Methodist University-College of Gradua...
5462            22.0                     University of Phoenix-Kentucky
5473            23.0               Johnson & Wales University-Charlotte
5713            18.0        Averett University-Non-Traditional Programs
5770            20.0                                      LIU Riverhead
5785            17.0                   Trident University International
5998            21.0                       Providence Christian College

[299 rows x 2 columns]

## Join Tables

## Clean Columns of Interest From Overall Data

+ ACT Scores
+ SAT Scores
+ HBCU
+ Diversity
+ Net Price
+ Gender Ratio
+ Location
+ Locale
+ Name
+ Acceptance Rate
+ Median Salary Post-Grad
+ LAC Rank
+ Univ Rank
+ Enrollment
+ NCAA Ranking
+ Type
+ Univ Description

In [35]:
univ_ranks.head()

,name,Location,Rank,Description,Tuition and fees,In-state,Undergrad Enrollment,univ
0,Princeton University,"Princeton, NJ",1,"Princeton, the fourth-oldest college in the Un...",45320,NaN,"5,402",univ
1,Harvard University,"Cambridge, MA",2,"Harvard is located in Cambridge, Massachusetts...",47074,NaN,"6,699",univ
2,University of Chicago,"Chicago, IL",3,"The University of Chicago, situated in Chicago...",52491,NaN,"5,844",univ
3,Yale University,"New Haven, CT",3,"Yale University, located in New Haven, Connect...",49480,NaN,"5,532",univ
4,Columbia University,"New York, NY",5,"Columbia University, located in Manhattan's Mo...",55056,NaN,"6,102",univ

# Final Column Drops